# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'mackup'


# Development
brew 'rbenv'
brew 'java'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask 'adobe-acrobat-reader'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'anki'
cask 'dash'
cask 'discord'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Trello', id: 1278508951
